---
kind: method
id: M:Autodesk.Revit.DB.PointRelativeToPoint.GetHostPointReference
source: html/609ac007-f461-f815-2ec1-2c4e14a457ba.htm
---
# Autodesk.Revit.DB.PointRelativeToPoint.GetHostPointReference Method

Get a copy of the host point reference.

## Syntax (C#)
```csharp
public Reference GetHostPointReference()
```